{
  "general": [
    {
      "id": "atomic-habits",
      "title": "Atomic Habits",
      "author": "James Clear",
      "description": "You fail because your systems are weak. This book teaches you how to build habits that actually stick. Clear shows you the science of 1% improvements—small changes that compound into real power. Stop relying on motivation. Build systems that make discipline automatic. This is fundamental training for anyone serious about self-mastery.",
      "asin": "0735211299",
      "coverImage": "https://m.media-amazon.com/images/I/51b4CfdTSDL._SY445_SX342_.jpg",
      "category": "general"
    },
    {
      "id": "webcam-cover",
      "title": "Webcam Cover Slider",
      "author": "CloudValley",
      "description": "Privacy is discipline. This thin metal slider blocks your camera when you're not using it. It's a physical reminder that someone could be watching. It's a barrier against recording yourself doing things you'll regret. Simple. Cheap. Effective. Stop trusting yourself with easy access. Block the camera.",
      "asin": "B079MCPJGH",
      "coverImage": "https://m.media-amazon.com/images/I/61Kez7aUF9L._AC_SY300_SX300_QL70_FMwebp_.jpg",
      "category": "general"
    },
    {
      "id": "your-brain-on-porn",
      "title": "Your Brain on Porn",
      "author": "Gary Wilson",
      "description": "You need to understand what this addiction does to your brain. Wilson explains the neurological damage in plain terms—how pornography hijacks your dopamine system and destroys your motivation. Knowledge is power. You cannot fight an enemy you don't understand. This book shows you exactly what you're up against and why willpower alone isn't enough. Read it.",
      "asin": "099316160X",
      "coverImage": "https://m.media-amazon.com/images/I/41Np3SXGQaL._SY445_SX342_FMwebp_.jpg",
      "category": "general"
    },
    {
      "id": "phone-lockbox",
      "title": "Kitchen Safe Time Lock Container",
      "author": "Kitchen Safe",
      "description": "Your phone is your enemy at night. You know this. This box locks your phone away for hours—you set the timer and you cannot open it until time's up. No willpower required. No negotiating with yourself at 2 AM. The box decides. You already know you can't trust yourself. Let the box be stronger than your urges.",
      "asin": "B00JGFQTD2",
      "coverImage": "https://m.media-amazon.com/images/I/81LOPVz63rL._AC_SY300_SX300_QL70_FMwebp_.jpg",
      "category": "general"
    },
    {
      "id": "dopamine-nation",
      "title": "Dopamine Nation",
      "author": "Dr. Anna Lembke",
      "description": "We live in an age of constant overstimulation. Dr. Lembke, a psychiatrist at Stanford, explains how modern pleasures—porn, social media, junk food—have turned us into dopamine addicts. She doesn't just diagnose the problem; she gives you the solution: strategic pain and deliberate discomfort to reset your brain. If you're serious about recovery, this book is essential.",
      "asin": "152474672X",
      "coverImage": "https://m.media-amazon.com/images/I/41r9KMGxtNL._SY445_SX342_FMwebp_.jpg",
      "category": "general"
    },
    {
      "id": "easy-peasy",
      "title": "The Easy Peasy Way to Quit Porn",
      "author": "Hackauthor",
      "description": "Stop using willpower and start using logic. This method deconstructs the brainwashing that makes you think you're 'giving something up.' Once you see the trap for what it is, walking away isn't hard—it's a relief. Read it and kill the 'Little Monster.'",
      "asin": "B0DDV3YBNK",
      "coverImage": "https://m.media-amazon.com/images/I/713EK7IbMZL._SY425_.jpg",
      "category": "non-fiction"
    },
    {
      "id": "breaking-addiction",
      "title": "Breaking Addiction: A 7-Step Handbook",
      "author": "Lance Dodes, MD",
      "description": "Understand the 'key moment' where you feel helpless. This Harvard-trained psychiatrist explains why addiction isn't a disease but a response to feeling trapped. Learn to identify the emotional fuse before the explosion happens.",
      "asin": "0061987395",
      "coverImage": "https://m.media-amazon.com/images/I/51NbcycVUsL._SY445_SX342_FMwebp_.jpg",
      "category": "non-fiction"
    },
    {
      "id": "treating-porn-addiction",
      "title": "Treating Pornography Addiction",
      "author": "Kevin Skinner, PhD",
      "description": "A tactical manual for rewiring the brain. If you want a structured plan for recovery based on clinical data, this is it. It provides the tools to map your brain and destroy the pathways that lead to relapse.",
      "asin": "097722080X",
      "coverImage": "https://m.media-amazon.com/images/I/418xTPrnjcL._SY445_SX342_FMwebp_.jpg",
      "category": "non-fiction"
    },
    {
      "id": "meditations",
      "title": "Meditations",
      "author": "Marcus Aurelius",
      "description": "The private journal of a Roman Emperor who ruled the world but fought daily to rule himself. 'The soul is dyed the color of its thoughts.' This is the ultimate guide to Stoic discipline and unshakeable clarity. Essential reading for men.",
      "asin": "1539952290",
      "coverImage": "https://m.media-amazon.com/images/I/41-Cj9+30ZL._SY445_SX342_FMwebp_.jpg",
      "category": "philosophy"
    },
    {
      "id": "siddhartha",
      "title": "Siddhartha",
      "author": "Hermann Hesse",
      "description": "The journey of a man who learns that he can 'fast, wait, and think.' It is the blueprint for mastering the body through the mind. You are not a slave to your impulses. You are the master of your path.",
      "asin": "1774267543",
      "coverImage": "https://m.media-amazon.com/images/I/41iAFEdErlL._SY445_SX342_FMwebp_.jpg",
      "category": "fiction"
    },
    {
      "id": "grip-trainer",
      "title": "Adjustable Grip Strength Trainer",
      "author": "FitBeast",
      "description": "Urges are nervous energy. Channel it. When the impulse hits, reach for this and squeeze until your forearms burn. Turn your weakness into physical power. Build a literal 'grip of steel' over your life.",
      "asin": "B07G824Z3V",
      "coverImage": "https://m.media-amazon.com/images/I/718tBdzFF6L._AC_SY300_SX300_QL70_FMwebp_.jpg",
      "category": "physical"
    },
    {
      "id": "blue-light-glasses",
      "title": "Blue Light Blocking Glasses",
      "author": "Benicci",
      "description": "Late night browsing is the death of discipline. Blue light keeps your brain in a 'seeking' mode. These glasses signal to your body that it's time to shut down. Sleep better, stay focused, and avoid the late-night slip-up.",
      "asin": "B086C66SZ2",
      "coverImage": "https://m.media-amazon.com/images/I/718y8rJhqSL._AC_SX569_.jpg",
      "category": "physical"
    },
    {
      "id": "precision-spinning-top",
      "title": "Precision Machined Spinning Top",
      "author": "ForeverSpin Style",
      "description": "A physical anchor for a wandering mind. When the brain fog sets in, spin this. Watch it. Focus on it. It's a tactile reminder to stay present in reality instead of drifting into digital fantasies. A masterwork of engineering.",
      "asin": "B00O396KBC",
      "coverImage": "https://m.media-amazon.com/images/I/510cek1mPtL._AC_SX679_.jpg",
      "category": "physical"
    },
    {
      "id": "cant-hurt-me",
      "title": "Can't Hurt Me",
      "author": "David Goggins",
      "description": "Most people operate at 40% of their capability. Goggins shows you how to blow past that wall. This isn't about feeling good—it's about calloussing your mind against the comfort that is killing you. Master your own brain or be its slave.",
      "asin": "1544512287",
      "coverImage": "https://m.media-amazon.com/images/I/41xnIg4C46L._SY445_SX342_FMwebp_.jpg",
      "category": "non-fiction"
    },
    {
      "id": "fight-club",
      "title": "Fight Club",
      "author": "Chuck Palahniuk",
      "description": "You are a slave to the pixels on your screen. Palahniuk’s masterpiece is a wake-up call for a generation of men raised to believe in a lie. Strip away the distractions to find the raw truth. Stop being a spectator. Start living.",
      "asin": "0393355942",
      "coverImage": "https://m.media-amazon.com/images/I/41fKj85d0VL._SY445_SX342_FMwebp_.jpg",
      "category": "fiction"
    },
    {
      "id": "ice-bath",
      "title": "Ice Bath Cold Plunge Tub",
      "author": "Bubplay",
      "description": "The ultimate reset button for a dopamine-fried brain. When an urge hits, get in the ice. The physiological shock forces your mind into the present and floods your system with norepinephrine. Kill the impulse. Build mental armor.",
      "asin": "B0CSK9CK4X",
      "coverImage": "https://m.media-amazon.com/images/I/71c+aiV9twL._AC_SX679_.jpg",
      "category": "physical"
    }
  ],
  "affiliateDisclosure": "As an Amazon Associate, I earn from qualifying purchases. This helps support the development of Clarity Blocker at no extra cost to you."
}
